Revit 2024 API
SharedParameterElement.Create Method
 Creates a new shared parameter element in the document representing the parameter stored in the input ExternalDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public static SharedParameterElement Create(
	Document document,
	ExternalDefinition sharedParameterDefinition
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	sharedParameterDefinition As ExternalDefinition _
) As SharedParameterElement
Visual C++
public:
static SharedParameterElement^ Create(
	Document^ document,
	ExternalDefinition^ sharedParameterDefinition
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
sharedParameterDefinition
Type: Autodesk.Revit.DB.ExternalDefinition
 Shared parameter definition.
Return Value
 The newly created shared parameter instance.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  A shared parameter with the assigned GUID is already loaded into the document.
See Also
SharedParameterElement Class
Autodesk.Revit.DB Namespace